DECLARE @CustomerGroup1 TABLE (
  KdNr int
);

INSERT INTO @CustomerGroup1 (KdNr)
VALUES (401008), (415106), (415205), (401548), (400387), (10003060), (400776), (415325), (400689), (10004534), (10004192), (400609), (401300), (400630), (428304), (415162), (400781), (400178), (415014), (415073), (400097), (400710), (401348), (400091), (415036), (415601), (400155), (415149), (401162), (400602), (415143), (400429), (401525), (400548), (400996), (10004317), (10005377), (401108), (415141), (400754), (401473), (10003010), (415066), (415140), (400666), (400182), (415068), (415623), (415050), (400037), (415127), (415134), (401248), (401450), (401449), (400253), (400385), (415371), (400793), (400907), (410087), (401254), (426554), (400546), (415115), (2730017), (415098), (415067), (415622), (400517), (415521), (415157), (415498), (2710195), (400028), (415006), (10005446), (400475), (400341), (400878), (415450), (10004415), (415200), (400454), (2710093), (400757), (10004205), (427962), (415011), (401371), (400906), (401351), (415108), (401436), (10002949), (10004124), (10004291), (415381), (415595), (415351), (401509), (400743), (2730072), (415448), (415581), (415582), (415583), (400811), (415116), (401226), (10004459), (415030), (400792), (10004734), (10004937), (415099), (401521), (415570), (415015), (400215), (2710235), (400610), (415276), (10003240), (426458), (400686), (415097), (415568), (400676), (400149), (10003135), (400519), (415167), (400239), (2710505), (10003503), (2710170), (415294), (415505), (10004283), (10004479), (415154), (427466), (401732), (415039), (415626), (10005200), (2730068), (426784), (415032), (415075), (401502), (415129), (401096), (427350), (10004681), (10004501), (10005215), (10005214), (415161), (415104), (10004147), (415471), (400606), (400345), (10005125), (10005092), (400740), (415112), (401218), (400451), (400778), (401223), (400708), (400537), (10004733), (425090), (400227), (415085), (415599), (400170), (415012), (2710503), (415185), (415061), (10005217), (400981), (401744), (10002863), (415080), (415427), (10005422), (401338), (401328), (401645), (401492), (415158), (400485), (400460), (400643), (10002933), (425152), (400286), (400395), (415053), (415111), (415042), (415063), (415054), (415091), (415100), (10004822), (10004882), (401439), (415156), (400164), (400706), (415113), (415619), (10003455), (400622), (415191), (425226), (415199), (415584), (10004389), (401301), (426433), (10005794), (415277), (401064), (428406), (415084), (415118), (415117), (400442), (415563), (415516), (10004104), (415433), (415051), (415052), (400779), (415025), (415007), (415040), (400457), (2710111), (425207), (415186), (415056), (415018), (426009), (410054), (415094), (425853), (415077), (401680), (10004338), (400317), (426313), (400755), (415072), (415000), (415621), (2710244), (415079), (10004623), (415425), (415090), (415565), (415609), (401716), (10005045), (415513), (426463), (10003439), (415357), (400688), (400668), (415070), (415222), (415579), (415387), (415081), (400350), (415155), (415103), (415065), (2710136), (415598), (415178), (415114), (401016), (400660), (401684), (400739), (415434), (428468), (401685), (401520), (2710242), (400476), (426646), (400343), (415023), (415148), (415361), (401344), (415031), (415177), (415102), (415002), (415135), (400709), (415001), (400338), (415537), (2710230), (10003593), (400488);

DECLARE @CustomerGroup2 TABLE (
  KdNr int
);

INSERT INTO @CustomerGroup2 (KdNr)
VALUES (415010), (10004931), (10004892), (401175), (415209), (401747), (2710240), (10005253), (415194), (10004639), (415569), (10004851), (415367), (415613), (415196), (2710059), (401370), (415576), (2710502), (10003607), (10003138), (10004060), (415593), (415029), (10004602), (401743), (10003426), (10003427), (10003425), (10003109), (401757), (10004446), (415192), (10004341), (415198), (10003589), (2710167), (2710504), (2710501), (415577), (415605), (415606), (428522), (401466), (10004358), (415048), (10005306), (415049), (10004594), (10004077), (415195), (415133), (401298), (415095), (415013), (415202), (401033), (10003531), (10003530), (10003514), (10003511), (10003342), (10003970), (10003537), (10003539), (10003518), (10003230), (10003384), (10004791), (10003373), (10004608), (10003538), (415193), (10005225), (400767), (415169), (10003372), (10004696), (415159), (401310), (415588), (415088), (10002990), (10003963), (10005108), (10005102), (400469);

DECLARE @UserID int = (SELECT ID FROM Mitarbei WHERE UserName = N'THALST');

/* Customer Group 1 */
INSERT INTO VsaTexte (KundenID, TextArtID, Memo, VonDatum, BisDatum, Anlage_, AnlageUserID_, UserID_)
SELECT DISTINCT KundenID = Kunden.ID,
  TextArtID = 13,
  Memo = N'Vážené dámy, vážení pánové,

poslední měsíce byly pro Vás, ale i pro naši společnost obzvláště těžké a z hospodářského hlediska znamenaly velkou výzvu. Zdražování v oblasti logistiky, nákupu textilu, ale také v personálním sektoru nebylo možné navzdory plynulé optimalizaci ve výrobě kompenzovat. Rovněž učiněná covidová opatření, stejně jako dopady pandemie vedly ke značným dodatečným nákladům. 
S ohledem na dohodu mezi našimi společnostmi, zvyšujeme doposud platné ceny od 1.2. o 8,75%. 
Žádáme Vás o pochopení pro tato opatření. Jsou základem pro zajištění našich služeb v odpovídající kvalitě i v budoucnosti.

S pozdravem SALESIANER
',
  VonDatum = CAST(N'2022-01-21' AS date),
  BisDatum = CAST(N'2022-05-15' AS date),
  Anlage_ = GETDATE(),
  AnlageUserID_ = @UserID,
  UserID_ = @UserID
FROM Kunden
WHERE Kunden.KdNr IN (SELECT KdNr FROM @CustomerGroup1);

/* Customer Group 2 */
INSERT INTO VsaTexte (KundenID, TextArtID, Memo, VonDatum, BisDatum, Anlage_, AnlageUserID_, UserID_)
SELECT DISTINCT KundenID = Kunden.ID,
  TextArtID = 13,
  Memo = N'Vážené dámy, vážení pánové,

poslední měsíce byly pro Vás, ale i pro naši společnost obzvláště těžké a z hospodářského hlediska znamenaly velkou výzvu. Zdražování v oblasti logistiky, nákupu textilu, ale také v personálním sektoru nebylo možné navzdory plynulé optimalizaci ve výrobě kompenzovat. Rovněž učiněná covidová opatření, stejně jako dopady pandemie vedly ke značným dodatečným nákladům. 
S ohledem na dohodu mezi našimi společnostmi, Vás v nejbližších dnech kontaktuje náš obchodní zástupce a projedná osobně navýšení cen. 
Žádáme Vás o pochopení pro tato opatření. Jsou základem pro zajištění našich služeb v odpovídající kvalitě i v budoucnosti.

S pozdravem SALESIANER
',
  VonDatum = CAST(N'2022-01-21' AS date),
  BisDatum = CAST(N'2022-05-15' AS date),
  Anlage_ = GETDATE(),
  AnlageUserID_ = @UserID,
  UserID_ = @UserID
FROM Kunden
WHERE Kunden.KdNr IN (SELECT KdNr FROM @CustomerGroup2);